БухЭксп/Documents/CW_ДвижениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ДвижениеДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_КурсовыеРазницы</xr:Item>
				<xr:Item>AccountingRegister.CW_МСФО</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяКредиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяДебиторскаяЗадолженность</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаВходящихДокументов</xr:Item>
				<xr:Item>AccumulationRegister.CW_РасходыПоПриобретениям</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаИсходящихДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперацийДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеСтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДляЖурнала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.CW_МСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНДС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.CW_МСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтразитьВСоставеРасходовПоПриобретениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расшифровка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ОперативнаяДебиторскаяЗадолженность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ОперативнаяДебиторскаяЗадолженность</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыДвиженийПоОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОплатаИсходящихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОплатаИсходящихДокументов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПризнакАкта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетЗадолженности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументБУ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОплатаВходящихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОплатаВходящихДокументов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПризнакАкта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетЗадолженности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументБУ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Documents/CW_ДвижениеДенежныхСредств/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// контроль загрузки
	Если ОбменДанными.Загрузка или РучнаяКорректировка Тогда 
		Возврат; 
	КонецЕсли;
	
	БазоваяВалюта 	= CW_Настройки.ВалютаРегламентированногоУчета();
	ВалютаКассы 	= Касса.Валюта;
	КурсВД 			= CW_Финансы.ПолучитьКурсВалюты(Валюта,Дата);
	КурсВаютыКассы 	= CW_Финансы.ПолучитьКурсВалюты(ВалютаКассы,Дата);
	Курсовые 		= Ложь;
	ИмяРегистраОперативнойЗадолженности = "";

	ВидыОперацийДДС = Перечисления.CW_ВидыОперацийДДС;
	
	Коэффициент = 1;
	Если ВидОперации = ВидыОперацийДДС.ВозвратОтПоставщика 
		ИЛИ ВидОперации = ВидыОперацийДДС.ВозвратПокупателю Тогда 
		Коэффициент = -1;
	КонецЕсли;
	
	ДвиженияПоРасшифровке = Ложь;
	Если ВидОперации = ВидыОперацийДДС.ПоступлениеОтПокупателя  Тогда

		ДвиженияПоРасшифровке 		= Истина;
		ВидДвиженияКассы 			= ВидДвиженияНакопления.Приход;
		ВидДвиженияЗадолженности	= ВидДвиженияНакопления.Расход;
		РегистрЗадолженность		= Движения.CW_ОперативнаяДебиторскаяЗадолженность;
		РегистрОплаты 				= Движения.CW_ОплатаИсходящихДокументов;
		ИмяРегистраОперативнойЗадолженности = "CW_ОперативнаяДебиторскаяЗадолженность";
		
	ИначеЕсли ВидОперации = ВидыОперацийДДС.ВозвратПокупателю Тогда
		
		ДвиженияПоРасшифровке 		= Истина;
		ВидДвиженияКассы 			= ВидДвиженияНакопления.Расход;
		ВидДвиженияЗадолженности	= ВидДвиженияНакопления.Расход;
		РегистрЗадолженность		= Движения.CW_ОперативнаяДебиторскаяЗадолженность;
		РегистрОплаты 				= Движения.CW_ОплатаИсходящихДокументов;
		ИмяРегистраОперативнойЗадолженности = "CW_ОперативнаяДебиторскаяЗадолженность";
		
	ИначеЕсли ВидОперации = ВидыОперацийДДС.ОплатаПоставщику Тогда
		ДвиженияПоРасшифровке 		= Истина;
		ВидДвиженияКассы 			= ВидДвиженияНакопления.Расход;
		ВидДвиженияЗадолженности	= ВидДвиженияНакопления.Расход;
		РегистрЗадолженность		= Движения.CW_ОперативнаяКредиторскаяЗадолженность;
		РегистрОплаты 				= Движения.CW_ОплатаВходящихДокументов;
		ИмяРегистраОперативнойЗадолженности = "CW_ОперативнаяКредиторскаяЗадолженность";

	ИначеЕсли ВидОперации = ВидыОперацийДДС.ВозвратОтПоставщика Тогда 
		
		ДвиженияПоРасшифровке 		= Истина;
		ВидДвиженияКассы 			= ВидДвиженияНакопления.Приход;
		ВидДвиженияЗадолженности	= ВидДвиженияНакопления.Расход;
		РегистрЗадолженность		= Движения.CW_ОперативнаяКредиторскаяЗадолженность;
		РегистрОплаты 				= Движения.CW_ОплатаВходящихДокументов;
		ИмяРегистраОперативнойЗадолженности = "CW_ОперативнаяКредиторскаяЗадолженность";

	ИначеЕсли ВидОперации = ВидыОперацийДДС.ОплатаПоставщикуПоПриобретениям Тогда 
		
		ДвиженияПоРасшифровке 		= Истина;
		ВидДвиженияКассы 			= ВидДвиженияНакопления.Расход;
		ВидДвиженияЗадолженности	= ВидДвиженияНакопления.Расход;
		РегистрЗадолженность		= Движения.CW_ОперативнаяКредиторскаяЗадолженность;
		РегистрОплаты 				= Движения.CW_ОплатаВходящихДокументов;
		ИмяРегистраОперативнойЗадолженности = "CW_ОперативнаяКредиторскаяЗадолженность";
		
	ИначеЕсли ВидОперации = ВидыОперацийДДС.ПрочиеПоступления Тогда 
		
		 ДвиженияПоРасшифровке 	= Ложь;
		 ВидДвиженияКассы 		= ВидДвиженияНакопления.Приход;
		 
	ИначеЕсли ВидОперации = ВидыОперацийДДС.ПрочиеСписания Тогда 
		 
		ДвиженияПоРасшифровке 	= Ложь;
		ВидДвиженияКассы 		= ВидДвиженияНакопления.Расход;
		
	ИначеЕсли ВидОперации = ВидыОперацийДДС.ПеремещениеВДругуюКассу Тогда 
		
		ДвиженияПоРасшифровке 	= Ложь;
		ВидДвиженияКассы 		= ВидДвиженияНакопления.Расход; 
		
	КонецЕсли; 
	
	Движение = Движения.CW_ДенежныеСредства.Добавить();
	Движение.ВидДвижения 	= ВидДвиженияКассы;
	Движение.Период 		= Дата;
	Движение.Касса 			= Касса;
	Движение.Валюта 		= ВалютаКассы;
	Движение.СтатьяДДС 		= СтатьяДДС;  
	
	Если Не ДвиженияПоРасшифровке Тогда
		Движение.Сумма = СуммаВК;
	КонецЕсли;
	
	Если ДвиженияПоРасшифровке Тогда
		
		Курсовые = Валюта <> БазоваяВалюта;

		Движение.Сумма = Расшифровка.Итог("СуммаВК");
		
		Для каждого СтрокаРсшифровки Из Расшифровка Цикл
			
			СуммаВсегоВалюта 	= СтрокаРсшифровки.СуммаВД;
			СуммаВсего			= CW_Финансы.ПересчитатьИзВалютыВВалюту(СуммаВсегоВалюта,Валюта,БазоваяВалюта,КурсВД.Курс,1,КурсВД.Кратность,1);
			
			Движение = РегистрЗадолженность.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияЗадолженности;
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Валюта 		= Валюта;
			Движение.Контрагент 	= Контрагент;
			Движение.Договор 		= Договор;
			Движение.СчетУчета 		= СтрокаРсшифровки.Счет;
			Движение.Всего_Валюта 	= СуммаВсегоВалюта * Коэффициент;
			Движение.Всего 			= СуммаВсего * Коэффициент;
			
			Движение.ВидОперации = Перечисления.CW_ВидыДвиженийПоОперативнойЗадолженности.Оплата;
		
			//Подсистема.УчетПриложенийДоговоров
			Если ЗначениеЗаполнено(СтрокаРсшифровки.Документ) Тогда
				Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ПриложениеКДоговору", СтрокаРсшифровки.Документ.Метаданные()) Тогда
					Движение.ПриложениеКДоговору = СтрокаРсшифровки.Документ.ПриложениеКДоговору;
				Иначе
					Движение.ПриложениеКДоговору = ПриложениеКДоговору;
				КонецЕсли;
			Иначе
				Движение.ПриложениеКДоговору = ПриложениеКДоговору;
			КонецЕсли;
			//Подсистема.УчетПриложенийДоговоров
			
			Если ЗначениеЗаполнено(СтрокаРсшифровки.Документ) Тогда
				Движение.Счет = СтрокаРсшифровки.Документ;
			Иначе
				Движение.Счет = Ссылка;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаРсшифровки.Документ) Тогда
				
				Если (ТипЗнч(СтрокаРсшифровки.Документ)=Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")
					ИЛИ ТипЗнч(СтрокаРсшифровки.Документ)=Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")
					ИЛИ ТипЗнч(СтрокаРсшифровки.Документ)=Тип("ДокументСсылка.CW_РасходыПоПриобретениям")) Тогда
					
					Движение = РегистрОплаты.Добавить();
					Движение.Период 			= Дата;
					
					Движение.Документ 			= СтрокаРсшифровки.Документ;
					Движение.ДокументОплаты 	= Ссылка;
					Движение.СчетЗадолженности 	= СтрокаРсшифровки.Счет;
					Движение.Всего 				= СтрокаРсшифровки.СуммаВД * Коэффициент ;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	
	Если ОтразитьВСоставеРасходовПоПриобретениям Тогда
		
		СуммаБезНДСВВалюте = СуммаВК - СуммаНДС;
		
		Если ТипЗнч(Субконто1) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
			СтатьяЗатрат = Субконто1;
		ИначеЕсли ТипЗнч(Субконто2) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
			СтатьяЗатрат = Субконто2;
		ИначеЕсли ТипЗнч(Субконто3) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
			СтатьяЗатрат = Субконто3;
		Иначе
			СтатьяЗатрат = Справочники.СтатьиЗатрат.ПустаяСсылка()
		КонецЕсли;
		
		// регистр "CW_РасходыПоПриобретениям"
		Движение	= Движения.CW_РасходыПоПриобретениям.Добавить();
		Движение.Период         	= Дата;
		Движение.ДокументЗатрат  	= Ссылка;
		Движение.Организация     	= Организация;
		Движение.Валюта         	= ВалютаКассы;
		Движение.СтатьяЗатрат   	= СтатьяЗатрат;
		Движение.СтавкаНДС			= СтавкаНДС;
		Движение.СчетЗатрат         = Счет;
		
		Движение.Субконто1         	= Субконто1;
		Движение.Субконто2         	= Субконто2;
		Движение.Субконто3         	= Субконто3; 
		
		Движение.УчетНДС         	= УчитыватьНДС;
		Движение.СчетНДС         	= СчетНДС;

		Движение.Количество 		= Количество ;
		Движение.ВалютнаяСумма 		= СуммаБезНДСВВалюте ;
		Движение.ВалютнаяСуммаНДС 	= СуммаНДС;
		Движение.ВалютнаяСуммаВсего = СуммаВК;
		
		Движение.Сумма		       	= CW_Финансы.ПересчитатьИзВалютыВВалюту(Движение.ВалютнаяСумма	   , ВалютаКассы, БазоваяВалюта, КурсВаютыКассы.Курс, 1, КурсВаютыКассы.Кратность, 1);
		Движение.СуммаНДС		    = CW_Финансы.ПересчитатьИзВалютыВВалюту(Движение.ВалютнаяСуммаНДС  , ВалютаКассы, БазоваяВалюта, КурсВаютыКассы.Курс, 1, КурсВаютыКассы.Кратность, 1);
		Движение.СуммаВсего		    = CW_Финансы.ПересчитатьИзВалютыВВалюту(Движение.ВалютнаяСуммаВсего, ВалютаКассы, БазоваяВалюта, КурсВаютыКассы.Курс, 1, КурсВаютыКассы.Кратность, 1);
		
		Движение.Примечание		    = НазначениеПлатежа;
		
		//Пустые
		Движение.Контрагент     	= Справочники.Контрагенты.ПустаяСсылка();
		Движение.Договор        	= Справочники.CW_ДоговорыПоГрузоперевозкам.ПустаяСсылка();
		
		//Подсистема.УчетПриложенийДоговоров
		Движение.ПриложениеКДоговору = Справочники.CW_ПриложенияКДоговорам.ПустаяСсылка();
		//Подсистема.УчетПриложенийДоговоров
		
		Движение.Номенклатура   	= Справочники.Номенклатура.ПустаяСсылка();

	КонецЕсли;
	
	Если ВидОперации=Перечисления.CW_ВидыОперацийДДС.ПеремещениеВДругуюКассу Тогда
		
		Движение = Движения.CW_ДенежныеСредства.Добавить();
		
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Касса 			= КассаПоступления;
		Движение.Валюта 		= КассаПоступления.Валюта;
		Движение.СтатьяДДС 		= ПоступлениеСтатьяДДС;
		
		Если (Движение.Валюта = ВалютаКассы) Тогда
			Движение.Сумма = СуммаВК;
		Иначе
			Движение.Сумма = СуммаВД;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если Курсовые Тогда
		СтруктураПарамтеров = Новый Структура;
		СтруктураПарамтеров.Вставить("Дата", 			Дата);
		СтруктураПарамтеров.Вставить("ВалютаОбъекта", 	Валюта);
		СтруктураПарамтеров.Вставить("Организация",		Организация);
		СтруктураПарамтеров.Вставить("Контрагент",		Контрагент);
		СтруктураПарамтеров.Вставить("Договор",			Договор);
		
		//Подсистема.УчетПриложенийДоговоров
		СтруктураПарамтеров.Вставить("ПриложениеКДоговору",			ПриложениеКДоговору);
		//Подсистема.УчетПриложенийДоговоров
		
		СтруктураПарамтеров.Вставить("ДатаСреза", 		МоментВремени());
		СтруктураПарамтеров.Вставить("Набор",			РегистрЗадолженность);
		СтруктураПарамтеров.Вставить("ИмяРегистраОперативнойЗадолженности",	ИмяРегистраОперативнойЗадолженности );
		
		CW_Финансы.СписаниеКурсовыеПоОперативнойЗадолженности(СтруктураПарамтеров);
	КонецЕсли; 
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = CW_Настройки.Пользователь();
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ВидОперации = Перечисления.CW_ВидыОперацийДДС.ПеремещениеВДругуюКассу Тогда
		КонтрагентДляЖурнала = КассаПоступления;
	Иначе
		КонтрагентДляЖурнала = Контрагент;
	КонецЕсли; 
	
	Если ПустаяСтрока(ПредставлениеДокумента) Тогда
		ПредставлениеДокумента = "Движение денежных средств "+СокрЛП(Номер)+" от "+Формат(Дата, "ДЛФ=DT");
	КонецЕсли;
	
КонецПроцедуры


#КонецЕсли
